source/emailapp/app/views/users/tour_start.html.haml

  Tour Date :
  = @user.tours.first.tour_date.to_s
---
SELECT  "tours".* FROM "tours"  WHERE "tours"."user_id" = ?  ORDER BY "tours"."id" ASC LIMIT 1  [["user_id", 1]]