source/emailapp/app/controllers/homes_controller.rb

  def invite
    email = params[:user][:email]

    params[:user][:invitation_token] = get_token
    params[:user][:invitation_at] = Time.now

    @user = User.find_by_email email
    @user.destroy unless @user.nil?
    @user = User.new(invite_params)

    if @user.save
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'james' LIMIT 1
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
INSERT INTO "users" ("created_at", "email", "invitation_at", "invitation_token", "updated_at") VALUES (?, ?, ?, ?, ?)