source/emailapp/app/controllers/tours_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "tours" ("amenity", "created_at", "note", "tour_date", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["amenity", "pool"], ["created_at", "2014-08-07 05:15:44.348529"], ["note", "Ok"], ["tour_date", "2014-08-07"], ["updated_at", "2014-08-07 05:15:44.348529"], ["user_id", 1]]
UPDATE "users" SET "confirmation_at" = ?, "confirmation_token" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["confirmation_at", "2014-08-07 05:15:44.385527"], ["confirmation_token", "80b089cd-5e9f-40e8-ae76-cd9a735848ed"], ["updated_at", "2014-08-07 05:15:44.389092"]]
---
  def create
    @user = User.find(params[:user_id])
    if @user.tours.create(permit_tour)
      @confirmation_token = get_token
      @confirmation_at = Time.now
      if @user.update(confirmation_token: @confirmation_token, confirmation_at: @confirmation_at)