source/emailapp/app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "first_name" = ?, "last_name" = ?, "phone" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["first_name", "James"], ["last_name", "Moore"], ["phone", "12049123"], ["updated_at", "2014-08-07 04:11:42.377818"]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(permit_for_update)